Function Reference

# Objects - Walls
| | | |
|---|---|---|
| AddCavity <sub>*obsolete in VectorWorks12.0*</sub>| AddSymToWall | AddSymToWallEdge |
| AddWallBottomPeak | AddWallPeak | BreakWall |
| ClearCavities <sub>*obsolete in VectorWorks12.5*</sub>| ClearWallPeaks | ConvertToUnstyledWall |
| CreateWallFeature | CreateWallStyle | DeleteWallPeak |
| DeleteWallSym | GetCurtainWallCutPl | GetCWFramesFromPt |
| GetCWPanelFromPt | GetLayerDeltaZOffset <sub>*obsolete in Vectorworks 2012*</sub>| GetLinkHeightToLayerDeltaZ <sub>*obsolete in Vectorworks 2012*</sub>|
| GetNumOfWallBreaks | GetNumWallPeaks | GetObjectWallHeight |
| GetObjectWallOffset | GetObjectWallPerpOff | GetObjExtentsInWall |
| GetObjWallBreakMode | GetObjWallInsertMode | GetObjWallInsLocOff |
| GetWallBelCutPlClass | GetWallCapAttributesType | GetWallCaps |
| GetWallCapsOffsets | GetWallCompEndPts | GetWallCompStartPts |
| GetWallControlOffset <sub>*obsolete in VectorWorks12.5*</sub>| GetWallCornerHeights | GetWallHalfBreakInfo |
| GetWallOverallHeights | GetWallPathType | GetWallPeak |
| GetWallPerpOffOfData | GetWallStyle | GetWallThickness |
| GetWallWidth | HWallHeight <sub>*obsolete in Vectorworks 2012*</sub>| HWallWidth |
| InsertSymbol | IsCurtainWall | IsWallPeakTop |
| JoinWalls | MoveWallByOffset | ReverseWallSides |
| RoundWall | SetCurtainWallCutPl | SetIsCurtainWall |
| SetLayerDeltaZOffset <sub>*obsolete in Vectorworks 2012*</sub>| SetLinkHeightToLayerDeltaZ <sub>*obsolete in Vectorworks 2012*</sub>| SetObjectAsCornerBreak |
| SetObjectAsSpanBreak | SetObjectWallHeight | SetObjectWallOffset |
| SetObjWallBreakMode | SetObjWallInsertMode | SetObjWallInsLocOff |
| SetWallBelCutPlClass | SetWallCapAttributesType | SetWallCaps |
| SetWallCapsOffsets | SetWallControlOffset <sub>*obsolete in VectorWorks12.5*</sub>| SetWallCornerHeights |
| SetWallHeights <sub>*obsolete in Vectorworks 2012*</sub>| SetWallOverallHeights | SetWallStyle |
| SetWallThickness | SetWallWidth <sub>*obsolete in VectorWorks12.0*</sub>| Wall |
| WallCap | WallFootPrint | WallHeight <sub>*obsolete in Vectorworks 2012*</sub>|
| WallPeak | WallTo | WallWidth |